adafruit/Adafruit_nRF52_Bootloader/src/boards/boards.c
#define BIT(n)  (1UL << (n))
#define IL0323_PSR_RES_WIDTH BIT(7)
#define IL0323_PSR_RES_HEIGHT BIT(6)
#define IL0323_PSR_LUT_REG BIT(5)
#define IL0323_PSR_LUT_OTP BIT(4)
#define IL0323_PSR_UD BIT(3)
#define IL0323_PSR_SHL BIT(2)
#define IL0323_PSR_SHD BIT(1)
#define IL0323_PSR_RST BIT(0)

#define IL0323_AUTO_PON_DRF_POF 0xA5
#define IL0323_AUTO_PON_DRF_POF_DSLP 0xA7

#define IL0323_CDI_REG_LENGTH 1U
#define IL0323_CDI_CDI_IDX 0

#define IL0323_TRES_REG_LENGTH 2U
#define IL0323_TRES_HRES_IDX 0
#define IL0323_TRES_VRES_IDX 1

#define IL0323_PTL_REG_LENGTH 5U
#define IL0323_PTL_HRST_IDX 0
#define IL0323_PTL_HRED_IDX 1
#define IL0323_PTL_VRST_IDX 2
#define IL0323_PTL_VRED_IDX 3
#define IL0323_PTL_PT_SCAN BIT(0)

/* Time constants in ms */
#define IL0323_RESET_DELAY 10U
#define IL0323_PON_DELAY 100U
#define IL0323_BUSY_DELAY 1U


const uint8_t lut_w[] =
{
0x60	,0x01	,0x01	,0x00	,0x00	,0x01	,
0x80	,0x0f	,0x00	,0x00	,0x00	,0x01	,
0x00	,0x00	,0x00	,0x00	,0x00	,0x00	,
0x00	,0x00	,0x00	,0x00	,0x00	,0x00	,
0x00	,0x00	,0x00	,0x00	,0x00	,0x00	,
0x00	,0x00	,0x00	,0x00	,0x00	,0x00	,
0x00	,0x00	,0x00	,0x00	,0x00	,0x00	,

};	
const uint8_t lut_b[] =
{
0x90	,0x01	,0x01	,0x00	,0x00	,0x01	,
0x40	,0x0f	,0x00	,0x00	,0x00	,0x01	,
0x00	,0x00	,0x00	,0x00	,0x00	,0x00	,
0x00	,0x00	,0x00	,0x00	,0x00	,0x00	,
0x00	,0x00	,0x00	,0x00	,0x00	,0x00	,
0x00	,0x00	,0x00	,0x00	,0x00	,0x00	,
0x00	,0x00	,0x00	,0x00	,0x00	,0x00	,

};

static void epd_controller_init(void) {
  
  uint8_t tmp[IL0323_TRES_REG_LENGTH];
  uint8_t pwr[] = {0x03, 0x00, 0x2b, 0x2b};
  tmp[0] = 0x3F;
  epd_cmd(0xD2, tmp, 1);
  tmp[0] = 0x6F;
  epd_cmd(IL0323_CMD_PSR, tmp, 1);
  epd_cmd(IL0323_CMD_PWR, pwr, sizeof(pwr));
  

  tmp[0] = IL0323_PSR_UD | IL0323_PSR_SHL | IL0323_PSR_SHD | IL0323_PSR_RST | IL0323_PSR_RES_HEIGHT;


  epd_cmd(IL0323_CMD_PSR, tmp, 1);
/* Set panel resolution */
  tmp[IL0323_TRES_HRES_IDX] = EPD_WIDTH;
  tmp[IL0323_TRES_VRES_IDX] = EPD_HEIGHT;
  epd_cmd(IL0323_CMD_TRES, tmp, IL0323_TRES_REG_LENGTH);

  tmp[0] = 0x00;
  tmp[1] = 0x00;

  epd_cmd(IL0323_CMD_LUTOPT, tmp, 2);

  tmp[0] = 0xF7;
  epd_cmd(IL0323_CMD_CDI, tmp, 1);

  tmp[0] = 0x22;
  epd_cmd(IL0323_CMD_TCON, tmp, 1);
  /* Enable Auto Sequence */
  tmp[0] = IL0323_AUTO_PON_DRF_POF;
  epd_cmd(IL0323_CMD_AUTO, tmp, 1);

  epd_cmd(IL0323_CMD_LUTW, lut_w, 42);
  epd_cmd(IL0323_CMD_LUTB, lut_b, 42);

  epd_cmd(IL0323_CMD_PON, NULL, 0);
  NRFX_DELAY_MS(IL0323_PON_DELAY);
  epd_bsy_wait();

}

static uint8_t old_buffer[1600];

#define IL0323_PIXELS_PER_BYTE 8U

/* Horizontally aligned page! */
#define IL0323_NUMOF_PAGES (EPD_PANEL_WIDTH / IL0323_PIXELS_PER_BYTE)
#define IL0323_PANEL_FIRST_GATE 0U
#define IL0323_PANEL_LAST_GATE (EPD_PANEL_HEIGHT - 1)
#define IL0323_PANEL_FIRST_PAGE 0U
#define IL0323_PANEL_LAST_PAGE (IL0323_NUMOF_PAGES - 1)

void board_epd_draw(uint8_t start_x,  uint8_t start_y, uint8_t end_x, uint8_t end_y, uint8_t const* buf, size_t nbytes) {
  uint8_t ptl[IL0323_PTL_REG_LENGTH] = {0};
  /* Setup Partial Window and enable Partial Mode */
    ptl[IL0323_PTL_HRST_IDX] = start_x;
    ptl[IL0323_PTL_HRED_IDX] = end_x;
    ptl[IL0323_PTL_VRST_IDX] = start_y;
    ptl[IL0323_PTL_VRED_IDX] = end_y;
    ptl[sizeof(ptl) - 1] = IL0323_PTL_PT_SCAN;

    epd_bsy_wait();
    epd_cmd(IL0323_CMD_PIN, NULL, 0);
    epd_cmd(IL0323_CMD_PTL, ptl, sizeof(ptl));
    epd_cmd(IL0323_CMD_DTM1, old_buffer, 1280);
    epd_cmd(IL0323_CMD_DTM2, buf, nbytes);

    memcpy(old_buffer, buf, 1280);

    epd_cmd(IL0323_CMD_DRF, NULL, 0);
    NRFX_DELAY_MS(1);
    epd_cmd(IL0323_CMD_POUT, NULL, 0);
}

#endif